RSN/src/Catalogs/ЗаявкиНаПредоставлениеДоступа/ЗаявкиНаПредоставлениеДоступа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЗаявкиНаПредоставлениеДоступа</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Срочность</name>
    <type>
      <types>EnumRef.ПриоритетыЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздатьПользователя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаявки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Наблюдатели</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>АдерсЭлПочты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Роль</name>
      <type>
        <types>EnumRef.РолиРассылки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Доступы</name>
    <attributes>
      <name>ИБ</name>
      <type>
        <types>CatalogRef.ИнформационныеБазы</types>
      </type>
    </attributes>
    <attributes>
      <name>Профиль</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступыГруппы</name>
    <attributes>
      <name>ИБ</name>
      <type>
        <types>CatalogRef.ИнформационныеБазы</types>
      </type>
    </attributes>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.ГруппыПрофилей</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RSN/src/InformationRegisters/ПрофилиПользователей/ПрофилиПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПрофилиПользователей</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Установлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ПользовательИБ</name>
    <type>
      <types>CatalogRef.ПользователиИБ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИБ</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Профиль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RSN/src/Enums/РолиРассылки/РолиРассылки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РолиРассылки</name>
  <enumValues>
    <name>Наблюдатель</name>
  </enumValues>
  <enumValues>
    <name>Исполнитель</name>
  </enumValues>
  <enumValues>
    <name>Ответственный</name>
  </enumValues>
  <enumValues>
    <name>Согласующий</name>
  </enumValues>
</mdclass:Enum>

RSN/src/Enums/КонфигурацииИнформационныхБаз/КонфигурацииИнформационныхБаз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонфигурацииИнформационныхБаз</name>
  <enumValues>
    <name>Бухгалтерия</name>
  </enumValues>
  <enumValues>
    <name>Зарплата</name>
  </enumValues>
  <enumValues>
    <name>Документооборот</name>
  </enumValues>
  <enumValues>
    <name>УправлениеХолдингом</name>
  </enumValues>
  <enumValues>
    <name>БухгалтерияБИТ</name>
  </enumValues>
  <enumValues>
    <name>ГорнодобывающаяПромышленность</name>
  </enumValues>
</mdclass:Enum>

RSN/src/Catalogs/ГруппыПрофилей/ГруппыПрофилей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыПрофилей</name>
  <comment>новые права</comment>
  <attributes>
    <name>Конфигурация</name>
    <type>
      <types>EnumRef.КонфигурацииИнформационныхБаз</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>ПрофильИБ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RSN/src/Catalogs/ЗаявкиНаПредоставлениеДоступа/ManagerModule.bsl
#Область Интерфейс
Функция ПолучитьДанныеДляПисьмаПоЗаявкам(Заявки) Экспорт
	Ответ = Новый Структура("ЕстьОшибка, ОписаниеОшибки, Результат", Ложь, "", Неопределено);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаявкиНаПредоставлениеДоступа.Код КАК Код,
	               |	ЗаявкиНаПредоставлениеДоступа.Автор КАК Автор,
	               |	ЗаявкиНаПредоставлениеДоступа.Описание КАК Описание,
	               |	ЗаявкиНаПредоставлениеДоступа.Срочность КАК Срочность,
	               |	ЗаявкиНаПредоставлениеДоступа.ДатаЗаявки КАК ДатаЗаявки,
	               |	ЗаявкиНаПредоставлениеДоступа.ИмяПользователя КАК ИмяПользователя,
	               |	ЗаявкиНаПредоставлениеДоступа.Ссылка КАК Заявка
	               |ИЗ
	               |	Справочник.ЗаявкиНаПредоставлениеДоступа КАК ЗаявкиНаПредоставлениеДоступа
	               |ГДЕ
	               |	ЗаявкиНаПредоставлениеДоступа.Ссылка В(&Заявки)";
	Запрос.УстановитьПараметр("Заявки", Заявки);  
	ТЗ = Запрос.Выполнить().Выгрузить();
	Ответ.Вставить("Результат", ТЗ);
	Возврат Ответ;
КонецФункции

Функция ПолучитьДанныеДляПисьмаПоЗаявке(Заявка) Экспорт
	Ответ = Новый Структура("ЕстьОшибка, ОписаниеОшибки, Результат", Ложь, "", Неопределено);  
	Данные = ПолучитьДанныеДляПисьмаПоЗаявкам(Заявка);
	ЗаполнитьЗначенияСвойств(Ответ,Данные,"ЕстьОшибка,ОписаниеОшибки");
	Если Данные.ЕстьОшибка = Ложь Тогда 
		Стр = Данные.Результат[0];
		Структура = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Стр);
		Права = ПолучитьТчЗаявки(Заявка); 
		Структура.Вставить("ТЧПрава",Права);
		Ответ.Вставить("Результат", Структура);  
	КонецЕсли;
	Возврат Ответ;
КонецФункции

Функция ВыдатьПраваПоЗаявке(Заявка) Экспорт   
	Ответ = Новый Структура("ЕстьОшибка,ОписаниеОшибки,Результат",Ложь,"", Неопределено);
	Настройки 		= ОбработкаДанных.ПолучитьСистемноеПодключение();
	Аутентификация 	= Новый Структура("Аутентификация", Новый Структура("Пользователь, Пароль", Настройки.Логин, Настройки.Пароль));
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаявкиНаПредоставлениеДоступаДоступы.ИБ КАК ИБ,
	               |	ЗаявкиНаПредоставлениеДоступаДоступы.Профиль КАК Профиль
	               |ИЗ
	               |	Справочник.ЗаявкиНаПредоставлениеДоступа.Доступы КАК ЗаявкиНаПредоставлениеДоступаДоступы
	               |ГДЕ
	               |	ЗаявкиНаПредоставлениеДоступаДоступы.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗаявкиНаПредоставлениеДоступа.Ссылка КАК Ссылка,
	               |	ЗаявкиНаПредоставлениеДоступа.ИмяПользователя КАК ИмяПользователя,
				   |	ЗаявкиНаПредоставлениеДоступа.ИмяПользователя КАК Логин,
	               |	ЗаявкиНаПредоставлениеДоступа.СоздатьПользователя КАК СоздатьПользователя
	               |ИЗ
	               |	Справочник.ЗаявкиНаПредоставлениеДоступа КАК ЗаявкиНаПредоставлениеДоступа
	               |ГДЕ
	               |	ЗаявкиНаПредоставлениеДоступа.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Заявка);
	
	Пакет			= Запрос.ВыполнитьПакет(); 
	ТЗ				= Пакет[0].Выгрузить();
	ДанныеЗаявки	= Пакет[1].Выбрать();
	ДанныеЗаявки.Следующий();
	МассивИБ 		= ТЗ.ВыгрузитьКолонку("ИБ");
	МассивИБ 		= ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивИБ);   
	Отбор			= Новый Структура("ИБ"); 
	
	ЗначенияПоУмолчанию = Новый Структура;
	ЗначенияПоУмолчанию.Вставить("Пароль", 							"123");
	ЗначенияПоУмолчанию.Вставить("Почта", 							"");
	ЗначенияПоУмолчанию.Вставить("Аутентификация1С", 				Истина);
	ЗначенияПоУмолчанию.Вставить("ПотребоватьСменуПароляПриВходе", 	Истина);
	ЗначенияПоУмолчанию.Вставить("АутентификацияОС", 				Истина);
	ЗначенияПоУмолчанию.Вставить("Язык", 							"Русский");
	ЗначенияПоУмолчанию.Вставить("Логин", 							ДанныеЗаявки.Логин);
	ЗначенияПоУмолчанию.Вставить("ВходВПрограммуЗапрещен", 			Ложь);
	ЗначенияПоУмолчанию.Вставить("АдресЭлектроннойПочты", 			"");
	ЗначенияПоУмолчанию.Вставить("ПользовательОС", 					ЛогинВПользователяОс(ДанныеЗаявки.Логин));
	ЗначенияПоУмолчанию.Вставить("ПоказыватьВСпискеВыбора", 		Ложь);
	
	МассивОписаний = Новый Массив;
	Для Каждого База Из МассивИБ Цикл
		Отбор.ИБ 		= База;
		НайденныеСтроки = ТЗ.Скопировать(Отбор, "Профиль"); 
		Профили 		= НайденныеСтроки.ВыгрузитьКолонку("Профиль");
		РеквизитыИБ 	= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(База, "ПутьНаВебСервере, Конфигурация");
        ТекСтрока		= Новый Структура("ИБ,Профили", База, Профили);
		Результат = ЗарегистрироватьПользователяВБазеПолучателе(ЗначенияПоУмолчанию, ТекСтрока, РеквизитыИБ, Аутентификация);
		
		Если Результат.ЕстьОшибка Тогда 
			МассивОписаний.Добавить(Результат.ОписаниеОшибки);
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(МассивОписаний) Тогда 
		Ответ.ЕстьОшибка = Истина;
		Ответ.ОписаниеОшибки = СтрСоединить(МассивОписаний, Символы.ПС);
	КонецЕсли;
	
	Возврат Ответ;
КонецФункции

Функция ПолучитьНаблюдателейИзЗаявки(Заявка) Экспорт  
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаявкиНаПредоставлениеДоступаНаблюдатели.АдерсЭлПочты КАК АдерсЭлПочты
	               |ИЗ
	               |	Справочник.ЗаявкиНаПредоставлениеДоступа.Наблюдатели КАК ЗаявкиНаПредоставлениеДоступаНаблюдатели
	               |ГДЕ
	               |	ЗаявкиНаПредоставлениеДоступаНаблюдатели.Ссылка = &Ссылка
	               |	И ЗаявкиНаПредоставлениеДоступаНаблюдатели.Роль = &Роль
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПользователиКонтактнаяИнформация.АдресЭП
	               |ИЗ
	               |	Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЗаявкиНаПредоставлениеДоступа КАК ЗаявкиНаПредоставлениеДоступа
	               |		ПО ПользователиКонтактнаяИнформация.Ссылка = ЗаявкиНаПредоставлениеДоступа.Автор
	               |ГДЕ
	               |	СОКРЛП(ПользователиКонтактнаяИнформация.АдресЭП) = """"
	               |	И ЗаявкиНаПредоставлениеДоступа.Ссылка = &Ссылка";  
	Запрос.УстановитьПараметр("Ссылка",Заявка);
	Запрос.УстановитьПараметр("Роль", ПредопределенноеЗначение("Перечисление.РолиРассылки.Наблюдатель"));
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Ответ = Результат.ВыгрузитьКолонку("АдерсЭлПочты");
	Возврат Ответ;
КонецФункции

Функция ПолучитьСтруктуруПисьма() Экспорт
	Возврат Новый Структура("МассивАдресов,ШаблонТело,ШаблонТема,ДопПараметры");
КонецФункции

Функция ОтправитьПисьмо(Заявка,Структура) Экспорт   
	Ответ = Новый Структура("Результат, ОписаниеОшибки, ЕстьОшибка", Ложь, "", Ложь);  
	
	МассивСогласющих = Структура.МассивАдресов;//РегистрыСведений.УчастникиПочтовойРассылки.ПолучитьСогласующих(); 
	ШаблонТело 		 = Структура.ШаблонТело;//"Создана заявка %1 от %2 (%3): для пользователя %4 в базах (с правами) %5"; 
	ШаблонТема 		 = Структура.ШаблонТема;//"Требуется согласование доступа, заявка %1 от %2"; 
	ДопПараметры	 = Структура.ДопПараметры;
	
	УЗ = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	Если не РаботаСПочтовымиСообщениями.УчетнаяЗаписьНастроена(УЗ, Истина) Тогда   
		ОписаниеОшибки = "Не настроена системная учетная запись электронной почты.";
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки);
		Ответ.ЕстьОшибка 	 = Истина;
		Ответ.ОписаниеОшибки = ОписаниеОшибки;
		Возврат Ответ;
	КонецЕсли; 
	
	ОтветДанныеЗаявки = ПолучитьДанныеДляПисьмаПоЗаявке(Заявка);
	Если ОтветДанныеЗаявки.ЕстьОшибка Тогда 
		ОбщегоНазначения.СообщитьПользователю(ОтветДанныеЗаявки.ОписаниеОшибки);
		Ответ.ЕстьОшибка 	 = Истина;
		Ответ.ОписаниеОшибки = ОтветДанныеЗаявки.ОписаниеОшибки;
		Возврат Ответ;
	КонецЕсли;   
	ДанныеЗаявки = ОтветДанныеЗаявки.Результат;
	ДатаЗаявки 	 = Формат(ДанныеЗаявки.ДатаЗаявки,"ДФ=dd.MM.yyyy");  
	ДанныеЗаявки.ДатаЗаявки = ДатаЗаявки; 
	Если ДопПараметры = Неопределено = Ложь Тогда 
		Для Каждого Эл Из ДопПараметры Цикл
			Если ДанныеЗаявки.Свойство(Эл.Ключ) = Ложь Тогда 
				ДанныеЗаявки.Вставить(Эл.Ключ, Эл.Значение);
			КонецЕсли;
		КонецЦикла;                                   
	КонецЕсли; 
	Если ДанныеЗаявки.Свойство("АдресОтвета") = Ложь Тогда 
		ДанныеЗаявки.Вставить("АдресОтвета",УЗ.АдресЭлектроннойПочты);
	КонецЕсли;
	//Если ДанныеЗаявки.Свойство("Гуид") = Ложь Тогда 
	//	ДанныеЗаявки.Вставить("Гуид",Новый УникальныйИдентификатор);
	//КонецЕсли;	
	
	Сообщение 		 = Взаимодействия.ПараметрыПисьма();  
	МассивСогласющих = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивСогласющих);
	Инд = 0;
	Для Каждого Эл из МассивСогласющих Цикл 
		Если ЗначениеЗаполнено(Эл) = Ложь Тогда 
			Продолжить;
		КонецЕсли;
		Инд = Инд + 1;
		Стр = Сообщение.Получатели.Добавить();  
		Стр.Адрес 			= Эл;
		Стр.Представление 	= Эл;
	КонецЦикла;       
	Если Инд = 0 Тогда 
		Возврат Ответ;
	КонецЕсли;
	
	
	МассивПараметров = ПолучитьПараметрыИзСтроки(ШаблонТело);
	ТекстПисьма 	 = ЗаполнитьСтрокуШаблон(ШаблонТело,МассивПараметров,ДанныеЗаявки); 
	ТЧЗаявки		 = ДанныеЗаявки.ТЧПрава;
	ТаблицаHTML		 = ПолучитьТаблицуПисьмаИзЗаявки(ТЧЗаявки);
	
	МассивПараметров = ПолучитьПараметрыИзСтроки(ШаблонТема);  
	Тема 			 = ЗаполнитьСтрокуШаблон(ШаблонТема,МассивПараметров,ДанныеЗаявки); 
	
	Сообщение.Тема 	= Тема;      
	Сообщение.Текст = ПолучитьHTMLПисьмаИзЗаявки(ТаблицаHTML, ТекстПисьма, ДанныеЗаявки.ИмяПользователя);
	Сообщение.ДополнительныеПараметры.ФорматПисьма = ПредопределенноеЗначение("Перечисление.СпособыРедактированияЭлектронныхПисем.HTML");
	
	Результат = Взаимодействия.СоздатьПисьмо(Сообщение, УЗ);
	
	Если Результат.Отправлено = Ложь Тогда 
		ОбщегоНазначения.СообщитьПользователю("Письмо не создано/не отправлено: " + Результат.ОписаниеОшибки);
		
		Ответ.ЕстьОшибка 	 = Истина;
		Ответ.ОписаниеОшибки = Результат.ОписаниеОшибки;
		Возврат Ответ;
	КонецЕсли; 
	
	Ответ.Вставить("Результат", Новый Структура("Заявка,Письмо", Заявка,Результат.СсылкаНаПисьмо));
	Возврат Ответ;
КонецФункции


#КонецОбласти

Функция ПолучитьТчЗаявки(Заявка) Экспорт   
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаявкиНаПредоставлениеДоступаДоступы.ИБ КАК ИБ,
	               |	ЗаявкиНаПредоставлениеДоступаДоступы.Профиль КАК Профиль
	               |ПОМЕСТИТЬ Профиля
	               |ИЗ
	               |	Справочник.ЗаявкиНаПредоставлениеДоступа.Доступы КАК ЗаявкиНаПредоставлениеДоступаДоступы
	               |ГДЕ
	               |	ЗаявкиНаПредоставлениеДоступаДоступы.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗаявкиНаПредоставлениеДоступаДоступыГруппы.ИБ КАК ИБ,
	               |	ЗаявкиНаПредоставлениеДоступаДоступыГруппы.Группа КАК Группа,
	               |	ГруппыПрофилейСостав.ПрофильИБ КАК ПрофильИБ
	               |ПОМЕСТИТЬ Группы
	               |ИЗ
	               |	Справочник.ЗаявкиНаПредоставлениеДоступа.ДоступыГруппы КАК ЗаявкиНаПредоставлениеДоступаДоступыГруппы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыПрофилей.Состав КАК ГруппыПрофилейСостав
	               |		ПО ЗаявкиНаПредоставлениеДоступаДоступыГруппы.Группа = ГруппыПрофилейСостав.Ссылка
	               |ГДЕ
	               |	ЗаявкиНаПредоставлениеДоступаДоступыГруппы.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Профиля.ИБ КАК ИБ,
	               |	Профиля.Профиль КАК Профиль
	               |ПОМЕСТИТЬ ТолькоПрофиль
	               |ИЗ
	               |	Профиля КАК Профиля
	               |ГДЕ
	               |	НЕ Профиля.Профиль В
	               |				(ВЫБРАТЬ
	               |					т.ПрофильИБ
	               |				ИЗ
	               |					группы КАК т)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Группы.ИБ КАК ИБ,
	               |	Группы.Группа КАК Группа
	               |ПОМЕСТИТЬ ТолькоГруппы
	               |ИЗ
	               |	Группы КАК Группы
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТолькоПрофиль.ИБ КАК ИБ,
	               |	ТолькоПрофиль.ИБ.Конфигурация КАК Конфигурация,
	               |	ТолькоПрофиль.ИБ.Организация КАК Организация
	               |ИЗ
	               |	ТолькоПрофиль КАК ТолькоПрофиль
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ТолькоГруппы.ИБ,
	               |	ТолькоГруппы.ИБ.Конфигурация,
	               |	ТолькоГруппы.ИБ.Организация
	               |ИЗ
	               |	ТолькоГруппы КАК ТолькоГруппы
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТолькоГруппы.ИБ КАК ИБ,
	               |	ТолькоГруппы.Группа КАК Группа
	               |ИЗ
	               |	ТолькоГруппы КАК ТолькоГруппы
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТолькоПрофиль.ИБ КАК ИБ,
	               |	ТолькоПрофиль.Профиль КАК Профиль
	               |ИЗ
	               |	ТолькоПрофиль КАК ТолькоПрофиль";
	Запрос.УстановитьПараметр("Ссылка", Заявка);
	Пакет = Запрос.ВыполнитьПакет();
	Всего = Пакет.ВГраница();
	Иб 		= Пакет[Всего - 2].Выгрузить();
	Группы 	= Пакет[Всего - 1].Выгрузить();
	Профили = Пакет[Всего].Выгрузить();
	Ответ	= Новый Структура("ИБ,Группы,Профили",ИБ,Группы,Профили);
	Возврат Ответ;
КонецФункции

Функция ПолучитьТаблицуПисьмаИзЗаявки(ТЧЗаявки) Экспорт   
	HTML = 
    "<table border=""1"" cellpadding=""10px"">"
    + "<tbody>"
    + "<tr>"
	+ "<td><b>Организация</b></td>"
	+ "<td><b>Конфигурация</b></td>"
    + "<td><b>ИБ</b></td>"
    + "<td><b>Группа</b></td>"
    + "<td><b>Профиль</b></td>"
    + "</tr>";
	
	Отбор = Новый Структура("ИБ");
    Для Каждого СтрокаТЧ Из ТЧЗаявки.ИБ Цикл
		
		ЗаполнитьЗначенияСвойств(Отбор, СтрокаТЧ);
		
		ВремГруппы 	= ТЧЗаявки.Группы.Скопировать(Отбор);
		ВремПрофили = ТЧЗаявки.Профили.Скопировать(Отбор);
		СтрГруппы 	= СтрСоединить(ВремГруппы.ВыгрузитьКолонку("Группа"));
		СтрПрофили	= СтрСоединить(ВремПрофили.ВыгрузитьКолонку("Профиль"));
		
        HTML = HTML
        + "<tr>"
		+ "<td>" + HTMLБезопасно(Строка(СтрокаТЧ.Организация)) + "</td>"
		+ "<td>" + HTMLБезопасно(Строка(СтрокаТЧ.Конфигурация)) + "</td>"
        + "<td>" + HTMLБезопасно(Строка(СтрокаТЧ.Иб)) + "</td>"
        + "<td>" + HTMLБезопасно(Строка(СтрГруппы)) + "</td>"
        + "<td>" + HTMLБезопасно(Строка(СтрПрофили)) + "</td>"
        + "</tr>";
        
    КонецЦикла;
    
    HTML = HTML + "</tbody></table>";
    
    Возврат HTML;
КонецФункции

Функция ПолучитьHTMLПисьмаИзЗаявки(ТаблицаHTML, Подпись, ИмяПользователя) Экспорт
   
    HTMLПисьма =
        "<!DOCTYPE html PUBLIC ""-//W3C//DTD HTML 4.0 Transitional//EN"">"
        + "<html>"
        + "<head>"
        + "<meta http-equiv=""content-type"" content=""text/html;charset=utf-8""></meta>"
        + "<link rel=""stylesheet"" type=""text/css"" href=""__STYLE__""></link>"
        + "</head>"
        + "<body>"
        + "<p class=""MsoNormal""><b><span style=""font-size:17.0pt;line-height:107%;"
		+ "font-family:&quot;Georgia&quot;,serif;color:#323232;background:#F8F8F8"">"
		+ Подпись + "<o:p></o:p></span></b></p>"  
		+ "<p class=""MsoNormal"" style=""margin:0 0 12px 0;line-height:1.35"">"
		+ "<span style=""font-size:12.0pt;font-family:&quot;Arial&quot;,sans-serif;color:#323232;font-weight:bold"">"
		+ "Пользователь: "
		+ "</span>"
		+ "<span style=""font-size:12.0pt;font-family:&quot;Arial&quot;,sans-serif;color:#1F1F1F;font-weight:bold"">"
		+ ИмяПользователя
		+ "</span></p>"
		+ ТаблицаHTML
        + "</body>"
        + "</html>";
   
    Возврат HTMLПисьма;
   
КонецФункции   

Функция HTMLБезопасно(Значение) Экспорт
    
    Результат = СокрЛП(Значение);
    Результат = СтрЗаменить(Результат, "&", "&amp;");
    Результат = СтрЗаменить(Результат, "<", "&lt;");
    Результат = СтрЗаменить(Результат, ">", "&gt;");
    Результат = СтрЗаменить(Результат, """", "&quot;");
    
    Возврат Результат;
    
КонецФункции

Функция ЗаполнитьСтрокуШаблон(Строка,Массив,Данные) Экспорт
	Ответ = Строка; 
	Если ЗначениеЗаполнено(Массив) = Ложь Тогда 
		Возврат Ответ;
	КонецЕсли;
	
	СтрокаПараметры = СтрСоединить(Массив,",");
	Структура 		= Новый Структура(СтрокаПараметры);
	ЗаполнитьЗначенияСвойств(Структура, Данные);
	Для Каждого Эл Из Структура Цикл  
		Значение = "";
		Если ЗначениеЗаполнено(Эл.Значение) Тогда 
			Значение = Эл.Значение;
		КонецЕсли;
		Ответ = СтрЗаменить(Ответ, "{" + Эл.Ключ + "}", Значение);
	КонецЦикла;
	
	Возврат Ответ;
КонецФункции

Функция ПолучитьПараметрыИзСтроки(Строка) Экспорт    
	Ответ 	= Новый Массив;
	Остаток = Строка;
	Шаблон = "\{[^\{\}]+\}";
	
	Пока Истина Цикл
		Совпадение = СтрНайтиПоРегулярномуВыражению(Остаток, Шаблон);
		Если Совпадение.НачальнаяПозиция = 0 Тогда
			Прервать;
		КонецЕсли;
		
		Параметр = Сред(Остаток, Совпадение.НачальнаяПозиция, Совпадение.Длина);
		Ответ.Добавить(Сред(Параметр, 2, СтрДлина(Параметр) - 2));
		
		Остаток = Сред(Остаток, Совпадение.НачальнаяПозиция + Совпадение.Длина);
	КонецЦикла; 
	Ответ = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Ответ);
	Возврат Ответ;
КонецФункции

Функция ЛогинВПользователяОс(Логин)
	
	Ответ 			= "";
	ИсходныеДанные 	= СокрЛП(Логин);
		
	Если СтрНайти(ИсходныеДанные, " ") = 0 Тогда 
		//РеквизитЛогин = СтрЗаменить(ИсходныеДанные, ".", " ");
		ТестПользователь = ИсходныеДанные;
	Иначе                                          
		//РеквизитЛогин = ИсходныеДанные;
		ТестПользователь = СтрЗаменить(ИсходныеДанные, " ", "."); 
	КонецЕсли;
		
	Шаблон = ОбщегоНазначенияВызовСервера.ЗначениеДополнительнойКонстанты("ШаблонЗаполненияПользователя");
	
	Если Не ЗначениеЗаполнено(Шаблон) Тогда 
		ОбщегоНазначения.СообщитьПользователю("Не заполнено значение шаблона 'ШаблонЗаполненияПользователя'");
		Возврат Ответ;
	КонецЕсли;    
	
	Ответ = СтрШаблон(Шаблон, ТестПользователь);
	Возврат Ответ;
КонецФункции

Функция ЗарегистрироватьПользователяВБазеПолучателе(ОбъектРегистрации, ТекСтрокаПолучатель, РеквизитыБазыПолучателя, Аутентификация) 
	ОтветФункции = Новый Структура("ЕстьОшибка,ОписаниеОшибки,Результат",Ложь,"", Неопределено);
	МассивОшибок = Новый Массив;
	
	ТекстПодзапроса = ПодзапросПоискаПользователяПоНаименованию(ОбъектРегистрации);
		
	ГУИДПользователя = "";
	Попытка
		Ответ = Интеграция.ОбратитьсяКВебСервису(РеквизитыБазыПолучателя.ПутьНаВебСервере, "GET", "Catalogs/Users" + ТекстПодзапроса, Аутентификация);   
		Если ТипЗнч(Ответ) = Тип("Массив") И Ответ.Количество() > 0 Тогда
			ГУИДПользователя = Ответ[0].Ссылка;
		КонецЕсли;
	Исключение 
		ОбщегоНазначения.СообщитьПользователю("Не удалось обратиться к веб-сервису. Подробности см. в Журнале Регистрации.");		
	КонецПопытки;
	
	РеквизитыОбъекта = Новый Структура();          
	РеквизитыОбъекта.Вставить("Ссылка", 		ГУИДПользователя);
	РеквизитыОбъекта.Вставить("Наименование", 	ОбъектРегистрации.Логин); 
	РеквизитыОбъекта.Вставить("Недействителен", ОбъектРегистрации.ВходВПрограммуЗапрещен);  
	
	ОписаниеПользователяИБ = Новый Структура; 
	Если Не ЗначениеЗаполнено(ГУИДПользователя) Тогда
		
		ОписаниеПользователяИБ.Вставить("ПолноеИмя", 				ОбъектРегистрации.Логин);
		ОписаниеПользователяИБ.Вставить("Имя", 						ОбъектРегистрации.Логин);
		ОписаниеПользователяИБ.Вставить("Пароль", 					ОбъектРегистрации.Пароль);                           
		ОписаниеПользователяИБ.Вставить("АдресЭлектроннойПочты", 	ОбъектРегистрации.Почта);
		ОписаниеПользователяИБ.Вставить("ВходВПрограммуРазрешен", 	Не ОбъектРегистрации.ВходВПрограммуЗапрещен);
		ОписаниеПользователяИБ.Вставить("АутентификацияСтандартная", ОбъектРегистрации.Аутентификация1С);
		ОписаниеПользователяИБ.Вставить("АутентификацияОС", 		ОбъектРегистрации.АутентификацияОС);
		ОписаниеПользователяИБ.Вставить("ПользовательОС", 			ОбъектРегистрации.ПользовательОС);
		ОписаниеПользователяИБ.Вставить("ПоказыватьВСпискеВыбора",  ОбъектРегистрации.ПоказыватьВСпискеВыбора);
		ОписаниеПользователяИБ.Вставить("ПотребоватьСменуПароляПриВходе", ОбъектРегистрации.ПотребоватьСменуПароляПриВходе);			
		ОписаниеПользователяИБ.Вставить("Язык", 					?(ЗначениеЗаполнено(ОбъектРегистрации.Язык), ОбъектРегистрации.Язык, "Английский"));    
		
		ОписаниеПользователяИБ.Вставить("Действие", "Записать"); 
		ОписаниеПользователяИБ.Вставить("ПарольУстановлен", 		ЗначениеЗаполнено(ОбъектРегистрации.Пароль)); 
			
		Если РеквизитыБазыПолучателя.Конфигурация = Перечисления.КонфигурацииИнформационныхБаз.УправлениеХолдингом Тогда
			ОписаниеПользователяИБ.Вставить("ОсновнойЯзыкУХ", "English");
		КонецЕсли; 
		
		РеквизитыОбъекта.Вставить("ДополнительныеСвойства", Новый Структура("ОписаниеПользователяИБ", ОписаниеПользователяИБ));
		
	КонецЕсли;	
	
	ДанныеДляДопОбработчиков = Новый Структура;
	ДанныеДляДопОбработчиков.Вставить("ПередЗаписью", 	Новый Структура("АдресЭлектроннойПочты", ОбъектРегистрации.Почта));
	ДанныеДляДопОбработчиков.Вставить("ПриЗаписи", 		Новый Структура("Профили", ТекСтрокаПолучатель.Профили));    		
	РеквизитыОбъекта.Вставить("ДопОбработчики", 		ДанныеДляДопОбработчиков);
	
	Если ЗначениеЗаполнено(ГУИДПользователя) Тогда
		ДанныеДляДопОбработчиков.ПередЗаписью.Удалить("АдресЭлектроннойПочты");	
	КонецЕсли;
	
	ПутьНаВебСервере = РеквизитыБазыПолучателя.ПутьНаВебСервере; 
	Попытка 
		Если Не ЗначениеЗаполнено(ГУИДПользователя) Тогда
			Ответ = Интеграция.ОбратитьсяКВебСервису(ПутьНаВебСервере, "POST", "Catalogs/Users", Аутентификация, РеквизитыОбъекта);  
		Иначе
			Ответ = Интеграция.ОбратитьсяКВебСервису(ПутьНаВебСервере, "PUT", "Catalogs/Users", Аутентификация, РеквизитыОбъекта);  
		КонецЕсли;
	Исключение
		ОбщегоНазначения.СообщитьПользователю("Ошибка при регистрации объекта " + ПутьНаВебСервере + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
	КонецПопытки; 
	
	Если ТипЗнч(Ответ) = Тип("Структура") И Ответ.Свойство("error") И Ответ.error Тогда    
		ТекстОшибки = "Ошибка при регистрации объекта " + ПутьНаВебСервере + Символы.ПС + Ответ.message;  
		ОтветФункции.ЕстьОшибка 	= Истина;
		ОтветФункции.ОписаниеОшибки = ТекстОшибки;
		//ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		//ТекСтрокаПолучатель.Результат = ТекстОшибки;
	ИначеЕсли ТипЗнч(Ответ) = Тип("Структура") И Ответ.Свойство("object_id") И СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(Ответ.object_id) Тогда 
		//ТекСтрокаПолучатель.Результат = "Ок"; 
		//ins+
		Ответ = Справочники.ПользователиИБ.СоздатьПользователей(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОбъектРегистрации.Логин),Истина);
		ПользовательИБ = Ответ.Результат.Получить(ОбъектРегистрации.Логин);
		Если ЗначениеЗаполнено(ПользовательИБ) Тогда 
			Структура = РегистрыСведений.ПрофилиПользователей.ПолучитьСтруктуруЗаписи();
			Структура.ПользовательИБ 	= ПользовательИБ;
			Структура.Иб 				= ТекСтрокаПолучатель.ИБ;
			РегистрыСведений.ПрофилиПользователей.ЗаписатьМассивПрофилей(Структура,ТекСтрокаПолучатель.Профили);
		КонецЕсли;
		//ins-
	Иначе
		ТекстОшибки = "Непредвиденная ошибка при регистрации пользователя! " + ОбъектРегистрации.Логин;  
		ОтветФункции.ЕстьОшибка		= Истина;
		ОтветФункции.ОписаниеОшибки = ТекстОшибки;
	КонецЕсли;				
	
	Возврат ОтветФункции;
КонецФункции 

Функция ПодзапросПоискаПользователяПоНаименованию(ОбъектРегистрации)
	
	Возврат
	
	"?Subrequest=" + 
	"ВЫБРАТЬ
	|	Ссылка
	|ИЗ
	|	Справочник.Пользователи
	|ГДЕ
	|	Наименование = """ + ОбъектРегистрации.Логин + """";
	
КонецФункции
